Tekla Open API Reference for Tekla Structures 2025
ProjectInfo Methods
The ProjectInfo type exposes the following members.
Methods
Name | Description
GetBasePointByGuid
 Gets a base point by given guid.
GetBasePointByName
 Gets a base point by given name.
GetBasePoints
 Gets all available base points as a list.
GetCurrentCoordsysBasePoint
 Gets the current base point, if set.
GetDoubleUserProperties
 Retrieves all double properties for the ProjectInfo.
GetDynamicStringProperty
 Gets a dynamic string property for the ProjectInfo.
GetIntegerUserProperties
 Retrieves all integer properties for the ProjectInfo.
GetProjectBasePoint
 Gets the project base point, if any set.
GetStringUserProperties
 Retrieves all string properties for the ProjectInfo.
GetUserProperty(String, Double)
 Retrieves a double property for the ProjectInfo.
GetUserProperty(String, Int32)
 Retrieves an integer property for the ProjectInfo.
GetUserProperty(String, String)
 Retrieves a string property for the ProjectInfo.
Modify
 Modifies the current project information.
SetCurrentCoordsysToBasePoint
 Sets the current base point.
SetDynamicStringProperty
 Sets a dynamic string property for the ProjectInfo.
SetUserProperty(String, Double)
 Sets a double property for the ProjectInfo.
SetUserProperty(String, Int32)
 Sets an integer property for the ProjectInfo.
SetUserProperty(String, String)
 Sets a string property for the ProjectInfo.
Top
See Also
Reference
ProjectInfo Class
Tekla.Structures.Model Namespace